export const questions = [
  {
    id: 212131,
    title: "سوالات متداول درباره خرید",
    qa: [
      {
        id: 1,
        question: "چگونه می‌توانم محصولی را سفارش دهم؟",
        answer:
          "شما می‌توانید با انتخاب محصول مورد نظر و افزودن آن به سبد خرید، فرآیند خرید را تکمیل کنید.",
      },
      {
        id: 2,
        question: "آیا امکان پرداخت در محل وجود دارد؟",
        answer:
          "بله، ما امکان پرداخت در محل را برای سفارشات داخل شهر فراهم کرده‌ایم.",
      },
      {
        id: 3,
        question: "چگونه می‌توانم سفارش خود را پیگیری کنم؟",
        answer:
          "شما می‌توانید با مراجعه به بخش پیگیری سفارش و وارد کردن کد رهگیری، وضعیت سفارش خود را بررسی کنید.",
      },
      {
        id: 4,
        question: "آیا امکان بازگرداندن کالا وجود دارد؟",
        answer:
          "بله، در صورت وجود مشکل در کالا، شما می‌توانید تا ۷ روز پس از دریافت، کالا را بازگردانید.",
      },
      {
        id: 5,
        question: "هزینه ارسال چگونه محاسبه می‌شود؟",
        answer: "هزینه ارسال بر اساس وزن کالا و مسافت ارسال محاسبه می‌شود.",
      },
    ],
  },
  {
    id: 256231,
    title: "سوالات متداول درباره حساب کاربری",
    qa: [
      {
        id: 6,
        question: "چگونه می‌توانم حساب کاربری ایجاد کنم؟",
        answer:
          "شما می‌توانید با کلیک روی گزینه 'ثبت نام' و پر کردن فرم مربوطه، حساب کاربری خود را ایجاد کنید.",
      },
      {
        id: 7,
        question: "چگونه رمز عبور خود را تغییر دهم؟",
        answer:
          "شما می‌توانید از بخش 'فراموشی رمز عبور' در صفحه ورود، رمز عبور خود را تغییر دهید.",
      },
      {
        id: 8,
        question: "آیا امکان ویرایش اطلاعات حساب کاربری وجود دارد؟",
        answer:
          "بله، شما می‌توانید از بخش 'ویرایش پروفایل' اطلاعات حساب کاربری خود را به روز رسانی کنید.",
      },
      {
        id: 9,
        question: "چگونه می‌توانم آدرس خود را تغییر دهم؟",
        answer:
          "شما می‌توانید از بخش 'مدیریت آدرس‌ها' در حساب کاربری خود، آدرس‌های ثبت شده را ویرایش یا حذف کنید.",
      },
      {
        id: 10,
        question: "آیا امکان حذف حساب کاربری وجود دارد؟",
        answer:
          "بله، شما می‌توانید از بخش 'تنظیمات حساب' درخواست حذف حساب کاربری خود را ارسال کنید.",
      },
    ],
  },
];
